This role is for one of the Weekday's clients

We are looking for a passionate and talented Software Development Engineer (SDE) Intern with a focus on backend development to join our team. This internship offers a unique opportunity to gain hands-on experience in building and maintaining scalable backend systems, working alongside experienced engineers, and contributing to real-world projects.

Responsibilities

Backend Development: Assist in the design, development, and maintenance of backend services and APIs. Write clean, maintainable, and efficient code under the guidance of senior engineers.
Collaboration: Work closely with frontend developers, product managers, and other team members to understand requirements and deliver high-quality solutions.
Code Reviews and Testing: Participate in code reviews to ensure code quality and share constructive feedback. Write unit and integration tests to ensure the robustness of the codebase.
Troubleshooting and Debugging: Assist in identifying and fixing bugs, performance bottlenecks, and other issues in the backend systems.
Learning and Development: Take advantage of learning opportunities provided during the internship, including working with new technologies, tools, and frameworks relevant to backend development.
Documentation: Contribute to the documentation of backend systems, APIs, and processes to support future development and maintenance.

Required Skills And Qualifications

Education: Currently pursuing a Bachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.
Programming Skills: Proficiency in at least one backend programming language such as Java, Python, Ruby, or Node.js. Familiarity with databases (SQL, NoSQL) and RESTful API design.
Problem-Solving Skills: Strong analytical and problem-solving abilities. Ability to work through technical challenges and find effective solutions.
Communication Skills: Good verbal and written communication skills. Ability to work well in a team environment and contribute effectively.
Learning Mindset: Enthusiasm for learning new technologies, frameworks, and best practices in software development. Openness to feedback and a desire to grow and improve.
Availability: Ability to commit to a full-time internship for the duration of the program.

Preferred Qualifications

Experience with version control systems (e.g., Git).
Familiarity with cloud services (AWS, Azure, Google Cloud).
Knowledge of containerization and orchestration tools (Docker, Kubernetes).
Previous internship or project experience in backend development.

Skills: backend development,code,design

_______________________
Role Description

We are excited to offer a full-time, on-site opportunity for a Software Trainee (Fresher - 3L) at Posnic's Chennai office. As a Software Trainee, you will embark on a journey to develop and refine your technical skills while contributing to the creation and maintenance of software solutions that cater to the evolving needs of modern retailers using PosnicPro. This role is perfect for fresh graduates who are passionate about technology and eager to apply their knowledge in a real-world setting.
Your day-to-day responsibilities will include:
Software Development: Engage in the development of new software features and functionalities for PosnicPro, ensuring they meet the high standards of performance and reliability expected by our clients.
Programming: Write clean, efficient, and well-documented code using modern programming languages and tools. You'll be working closely with experienced developers, learning best practices in coding and software development.
Database Management: Work with databases to ensure data is correctly stored, retrieved, and managed within PosnicPro. This includes tasks such as database design, query optimization, and data integrity checks.
Software Design: Collaborate with senior developers and designers to create software that is not only functional but also intuitive and user-friendly. You'll learn about designing systems that are scalable and easy to maintain.
Testing and Debugging: Participate in the testing phase of software development, identifying bugs, and working to resolve them. This is crucial in ensuring the final product is of the highest quality before it reaches our clients.


Qualifications

We are looking for candidates who are eager to learn, grow, and make a meaningful contribution to our team. The ideal candidate should have:

Proficiency in Software Development, Programming, and Software Design: A solid understanding of programming concepts and a passion for building software solutions.
Experience with Databases and Testing: While hands-on experience is a plus, a strong foundational knowledge of database systems and software testing processes is essential.
Strong Problem-Solving Skills and Attention to Detail: The ability to think critically and solve complex technical challenges with precision.
Knowledge of Software Development Life Cycle (SDLC) Processes: Understanding the stages of software development from planning and design to testing and deployment.
Ability to Work Well in a Team and Independently: Strong communication and collaboration skills, with the ability to take initiative and work independently when needed.
Bachelor's Degree in Computer Science, Engineering, or Related Field: While a degree is preferred, we value skills, passion, and the drive to learn above all.


This is a fantastic opportunity for a recent graduate to kickstart their career in software development at Posnic. If you are passionate about technology and eager to contribute to the success of retail businesses through innovative POS solutions, we encourage you to apply and join our dynamic team!

_____________________
React Developer at BeyondScale

The Opportunity

We're seeking a talented React Developer to join our growing team and play a crucial role in building the future of AI-powered ERP. You'll be responsible for crafting beautiful, user-friendly interfaces that bring Sitara's intuitive design to life.

What You'll Do

Develop and maintain highly interactive and responsive user interfaces (UIs) using ReactJS and its ecosystem.
Collaborate with designers and engineers to translate UI mockups into clean, maintainable React code.
Implement state management solutions, component-based design patterns, and utilise hooks effectively.
Translate UI designs into pixel-perfect CSS, ensuring a seamless user experience across devices.
Write clean, well-documented code that prioritises maintainability and future growth.
Actively participate in testing, debugging, and problem-solving to ensure a flawless user experience.
Utilise Git version control and adhere to modern development workflows for seamless collaboration.
Prior experience with React Native is a plus.

You're a Great Fit If You

Have 1+ years of experience building web applications with ReactJS.
Possess a strong understanding of core computer science principles like data structures and algorithms.
Are passionate about creating user-centric interfaces and delivering exceptional UX.
Thrive in a collaborative environment and enjoy working closely with designers and engineers.
Have excellent communication and problem-solving skills.
Are a coding craftsman who prioritises clean, maintainable code.

Why BeyondScale?

Impact: Be a part of a revolutionary product that empowers service-based businesses to thrive.
Innovation: Work at the forefront of AI and help shape the future of ERP software.
Autonomy & Growth: Take ownership of your work, gain access to production systems, and grow alongside the company.
Ground Floor Opportunity: Join a high-potential startup on the cusp of explosive growth.

Skills:- Javascript and React.js
-------------------------
    Job Title: Full Stack Intern
    Location: Hyderabad
    Duration: 4 Months


    Job Description:

    As a Full Stack Intern at Multiplier AI, you will leverage your existing experience with frontend and backend technologies to assist in developing, enhancing, and maintaining our web applications. You will collaborate closely with our skilled development team, contributing to projects.


    Key Responsibilities:

    Develop and maintain web applications using both frontend and backend technologies.
    Collaborate with the development team to design, develop, and implement new features and enhancements.
    Write clean, efficient, and well-documented code.
    Troubleshoot, debug, and resolve technical issues.
    Participate in code reviews and provide constructive feedback.
    Stay updated with the latest industry trends and technologies.
    Contribute to the design and architecture discussions.


    Qualifications:

    Currently pursuing or recently completed a degree in Computer Science, Information Technology, or a related field.
    Academic background with 60% and above will be a plus
    Proven experience with frontend technologies such as HTML, CSS, JavaScript, React JS and frameworks/libraries like React, Angular, or Vue.js.
    Hands-on experience with backend technologies such as Node.js, Python, Ruby on Rails, or PHP.
    Familiarity with databases like MySQL, PostgreSQL, MongoDB, or similar.
    Understanding of RESTful APIs and web services.
    Strong problem-solving skills and attention to detail.
    Excellent communication and teamwork skills.
    Eagerness to learn and adapt to new technologies and challenges.


    Preferred Qualifications:

    Experience with version control systems like Git.
    Familiarity with cloud services like AWS, Azure, or Google Cloud.
    Basic understanding of DevOps practices and tools.
    Experience with responsive design and mobile-first development.


    What We Offer:

    Hands-on experience with real projects and the opportunity to make a tangible impact.
    Mentorship from experienced developers and industry professionals.
    A collaborative and inclusive work environment.
    Potential for future employment opportunities based on performance.

    ---------------------------



    Here are 10 multiple-choice questions (MCQs) for each of the three sections: basic aptitude skills, basic technical skills, and niche technical skills. These questions are designed to filter candidates based on the job descriptions provided.

### 1. Basic Aptitude Skills

**1.** What is the next number in the series: 2, 6, 12, 20, 30, ...?
   - a) 38
   - b) 40
   - c) 42
   - d) 44  
   **Answer:** b) 40

**2.** A train travels 60 miles in 1 hour. How long will it take to travel 180 miles at the same speed?
   - a) 2 hours
   - b) 2.5 hours
   - c) 3 hours
   - d) 3.5 hours  
   **Answer:** c) 3 hours

**3.** If the area of a square is 81 square units, what is the length of one side of the square?
   - a) 7 units
   - b) 8 units
   - c) 9 units
   - d) 10 units  
   **Answer:** c) 9 units

**4.** What is 15% of 200?
   - a) 20
   - b) 25
   - c) 30
   - d) 35  
   **Answer:** c) 30

**5.** If 5x = 45, what is the value of x?
   - a) 7
   - b) 8
   - c) 9
   - d) 10  
   **Answer:** c) 9

**6.** A man spends 3/8 of his income on rent. If his income is $4000, how much does he spend on rent?
   - a) $1000
   - b) $1250
   - c) $1500
   - d) $1750  
   **Answer:** b) $1500

**7.** The sum of two consecutive even numbers is 36. What are the numbers?
   - a) 16 and 18
   - b) 18 and 20
   - c) 20 and 22
   - d) 22 and 24  
   **Answer:** b) 18 and 20

**8.** What is the probability of getting a head when a coin is tossed?
   - a) 0.25
   - b) 0.5
   - c) 0.75
   - d) 1.0  
   **Answer:** b) 0.5

**9.** If 20 workers can build a wall in 15 days, how many workers are required to build the same wall in 10 days?
   - a) 25
   - b) 30
   - c) 35
   - d) 40  
   **Answer:** b) 30

**10.** A person can swim 6 km/hr in still water. If the speed of the stream is 2 km/hr, how much time will he take to swim 8 km downstream?
   - a) 1 hour
   - b) 1.2 hours
   - c) 1.33 hours
   - d) 1.5 hours  
   **Answer:** c) 1.33 hours

### 2. Basic Technical Skills

**1.** What does HTML stand for?
   - a) HyperText Markup Language
   - b) HyperTool Multi Language
   - c) HyperLink Markup Language
   - d) HyperText Multiple Language  
   **Answer:** a) HyperText Markup Language

**2.** Which of the following is NOT a programming language?
   - a) Python
   - b) Java
   - c) HTML
   - d) Ruby  
   **Answer:** c) HTML

**3.** What is the main function of an operating system?
   - a) Manage hardware resources
   - b) Provide networking capabilities
   - c) Control peripheral devices
   - d) All of the above  
   **Answer:** d) All of the above

**4.** In a relational database, what is a primary key?
   - a) A unique identifier for each record
   - b) A key used to encrypt data
   - c) A key used for indexing
   - d) A key used to reference another table  
   **Answer:** a) A unique identifier for each record

**5.** Which of the following is a front-end technology?
   - a) MySQL
   - b) Node.js
   - c) CSS
   - d) MongoDB  
   **Answer:** c) CSS

**6.** Which command is used to check the version of Git installed?
   - a) git --version
   - b) git -v
   - c) git version
   - d) git checkversion  
   **Answer:** a) git --version

**7.** In JavaScript, what is the output of `console.log(2 + '2');`?
   - a) 4
   - b) 22
   - c) "4"
   - d) Error  
   **Answer:** b) 22

**8.** Which of the following SQL statements is used to delete data from a table?
   - a) DROP
   - b) REMOVE
   - c) DELETE
   - d) CLEAR  
   **Answer:** c) DELETE

**9.** Which of the following is NOT a NoSQL database?
   - a) MongoDB
   - b) Cassandra
   - c) PostgreSQL
   - d) CouchDB  
   **Answer:** c) PostgreSQL

**10.** Which of the following is a version control system?
   - a) Jenkins
   - b) Git
   - c) Docker
   - d) Kubernetes  
   **Answer:** b) Git

### 3. Niche Technical Skills

**1.** Which of the following is a backend framework?
   - a) React.js
   - b) Flask
   - c) Vue.js
   - d) Angular  
   **Answer:** b) Flask

**2.** What is the primary purpose of Docker?
   - a) Automate software testing
   - b) Virtualize applications in containers
   - c) Manage software versions
   - d) Monitor server performance  
   **Answer:** b) Virtualize applications in containers

**3.** In Kubernetes, what is a "pod"?
   - a) The smallest deployable unit
   - b) A cluster of containers
   - c) A storage unit
   - d) A network protocol  
   **Answer:** a) The smallest deployable unit

**4.** What does the `git rebase` command do?
   - a) Combines multiple commits into one
   - b) Deletes a branch
   - c) Applies changes from one branch to another
   - d) Merges two branches  
   **Answer:** c) Applies changes from one branch to another

**5.** In a RESTful API, what does the "PUT" method typically do?
   - a) Deletes a resource
   - b) Updates a resource
   - c) Retrieves a resource
   - d) Creates a new resource  
   **Answer:** b) Updates a resource

**6.** Which of the following cloud services is a Platform as a Service (PaaS)?
   - a) AWS EC2
   - b) Google App Engine
   - c) Amazon S3
   - d) Microsoft Azure Blob Storage  
   **Answer:** b) Google App Engine

**7.** What is the purpose of unit testing in software development?
   - a) To test the entire application as a whole
   - b) To test individual components in isolation
   - c) To test the user interface
   - d) To test the integration between modules  
   **Answer:** b) To test individual components in isolation

**8.** What is the significance of `npm` in Node.js?
   - a) A package manager for JavaScript
   - b) A server-side framework
   - c) A database management system
   - d) A security tool  
   **Answer:** a) A package manager for JavaScript

**9.** In React, what is a "hook"?
   - a) A new type of component
   - b) A way to manage state and side effects
   - c) A method to optimize performance
   - d) A mechanism to handle user events  
   **Answer:** b) A way to manage state and side effects

**10.** What is the role of a "load balancer" in a cloud infrastructure?
   - a) To manage database queries
   - b) To distribute incoming network traffic across multiple servers
   - c) To provide data storage
   - d) To monitor system performance  
   **Answer:** b) To distribute incoming network traffic across multiple servers

These questions should help you evaluate candidates effectively based on their skills in the relevant areas.